{"config": [{"config": {"input_dim": 500, "dtype": "float32", "input_length": 15, "output_dim": 64, "activity_regularizer": null, "embeddings_regularizer": null, "embeddings_constraint": null, "batch_input_shape": [null, 15], "mask_zero": false, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding_1", "trainable": true}, "class_name": "Embedding"}, {"config": {"kernel_regularizer": null, "kernel_size": [3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "name": "conv1d_1", "bias_constraint": null, "padding": "same", "filters": 32, "kernel_constraint": null, "activity_regularizer": null, "dilation_rate": [1], "strides": [1], "trainable": true}, "class_name": "Conv1D"}, {"config": {"padding": "same", "pool_size": [8], "name": "max_pooling1d_1", "trainable": true, "strides": [8]}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "units": 6, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow"}