{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_constraint": null, "input_dim": 350, "output_dim": 10, "embeddings_regularizer": null, "name": "Embedding", "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "input_length": 20, "mask_zero": false, "batch_input_shape": [null, 20], "trainable": true}}, {"class_name": "SpatialDropout1D", "config": {"noise_shape": null, "name": "SpatialDropout1D", "trainable": true, "rate": 0.2, "seed": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "dropout": 0.2, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "stateful": false, "return_state": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 16, "unit_forget_bias": true, "recurrent_constraint": null, "return_sequences": false, "name": "LSTM", "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "recurrent_dropout": 0.2, "unroll": false, "trainable": true, "implementation": 1}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "name": "Dense_softmax", "activation": "softmax", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 6, "trainable": true}}]}