{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "trainable": true, "embeddings_constraint": null, "name": "embedding_1", "activity_regularizer": null, "input_length": 15, "embeddings_regularizer": null, "batch_input_shape": [null, 15], "dtype": "float32", "input_dim": 450, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "output_dim": 64}}, {"class_name": "Conv1D", "config": {"trainable": true, "filters": 32, "activity_regularizer": null, "use_bias": true, "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3], "bias_constraint": null, "padding": "same", "kernel_constraint": null, "dilation_rate": [1], "activation": "relu", "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "padding": "same", "strides": [8], "trainable": true, "pool_size": [8]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "units": 6, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.3"}