{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "trainable": true, "embeddings_constraint": null, "name": "Embedding", "activity_regularizer": null, "input_length": 20, "embeddings_regularizer": null, "batch_input_shape": [null, 20], "dtype": "float32", "input_dim": 350, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "output_dim": 10}}, {"class_name": "SpatialDropout1D", "config": {"name": "SpatialDropout1D", "rate": 0.2, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "LSTM", "config": {"return_state": false, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "LSTM", "bias_regularizer": null, "unroll": false, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "implementation": 1, "stateful": false, "bias_constraint": null, "units": 16, "dropout": 0.2, "kernel_constraint": null, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"name": "Dense_softmax", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "units": 6, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.3"}